{
    "data": { 
       "status" : "success",
       "data":[
            {
                "id" : 1,
                "title": "Elasticsearch系列---搜索执行过程及scroll游标查询",
                "author": "cathetine",
                "content": "概要本篇主要介绍一下分布式环境中搜索的两阶段执行过程。 两阶段搜索过程 回顾我们之前的CRUD操作，因为只对单个文档进行处理，文档的唯一性很容易确定，并且很容易知道是此文档在哪个node，哪个shard中。但搜索比CRUD复杂，符合搜索条件的文档，可能散落在各个node、各个shard中，我们需要找到匹配的文档，并且把从各个node，各个shard返回的结果进行汇总、排序，组成一个最终的结果排序列表，才算完成一个搜索过程。我们将按两阶段的方式对这个过程进行讲解。",
                "categories":[
                    "Elasticsearch"
                ]
            },
            {
                "id" : 2,
                "title": "分布式初探——讲透分布式系统一致性模型",
                "author": "Curry",
                "content": "在计算机系统的领域，一致性可以说是一个高频词，可能出现的场景很多。从分布式系统到数据库的事务，都有它的身影。之前我们在介绍数据库事务的时候，谈到过事务的一致性。在数据库当中，一致性是一种目的，不是一种手段。数据库希望控制事务的原子性、隔离性和持久性来保证数据的一致性。这里的一致性更多的指的是实际和我们观念的一致。也就是说结果都在我们预期之内。而在分布式系统当中，一致性有另外的含义，一个是多份数据副本之间的一致性问题，另一个是多阶段提交的一致性问题。我们今天先来聊聊副本一致性问题。这个问题出现的原因很简单，因为分布式系统当中，数据往往会有多个副本。如果是一台数据库处理所有的数据请求，那么通过ACID四原则，基本可以保证数据的一致性。而多个副本就需要保证数据会有多份拷贝。这就带来了同步的问题，因为我们几乎没有办法保证可以同时更新所有机器当中的包括备份所有数据。尤其是当这些机器分布在全国各地甚至是世界各地的时候，由于网络延迟，即使我在同一时间给所有机器发送了更新数据的请求，也不能保证这些请求被响应的时间保持一致。只要存在时间差，就会存在某些机器之间的数据不一致的情况。也就是说，在分布式系统当中的一致性，指的是数据一致性。这其实是一个两难问题，为了解决流量过大的压力问题，我们设计了分布式系统。但是分布式系统又会带来数据多份拷贝不同步违反一致性的问题，我们既不能容忍数据出错，也不能放弃分布式系统，唯一的办法就是采取一些措施，来最大可能地降低这个问题的影响力。",
                "categories":[
                    "分布式",
                    "CAP"
                ]
            },
            {
                "id" : 3,
                "title": "什么是注解？",
                "author": "cathetine",
                "content": "一、概念Java 注解是在 JDK5 时引入的新特性，注解（也被称为元数据）为我们在代码中添加信息提供了一种形式化的方法，使我们可以在稍后某个时刻非常方便地使用这些数据。注解类型定义指定了一种新的类型，一种特殊的接口类型。 在关键词 interface 前加 @ 符号也就是用 @interface 来区分注解的定义和普通的接口声明。目前大部分框架(如 Spring Boot 等)都通过使用注解简化了代码并提高的编码效率。二、作用提供信息给编译器： 编译器可以利用注解来探测错误和警告信息，如 @Override、@Deprecated.  编译阶段时的处理： 软件工具可以用来利用注解信息来生成代码、Html 文档或者做其它相应处理，如 @Param、@Return、@See、@Author 用于生成 Javadoc 文档。 运行时的处理： 某些注解可以在程序运行的时候接受代码的提取，值得注意的是，注解不是代码本身的一部分。如Spring 2.5 开始注解配置，减少了配置。",
                "categories":[
                    "注解"
                ]
            }
        ]
    }
}